CREATE VIEW Продукція_пр AS SELECT DISTINCT Код_продукції, Назва_продукції, Тип_продукції 
FROM Продукція;

SELECT * FROM Продукція
Where Ціна_оптова<=8;

SELECT Продукція.Код_продукції, Продукція.Назва_продукції, Продукція.Тип_продукції, 
Рецепт.Вид_тіста, Рецепт.Начинка, Рецепт.[Трив_приготування(хв)] FROM Продукція, Рецепт
WHERE Продукція.Код_рецепту = Рецепт.Код_рецепту

SELECT Продукція.Код_продукції, Продукція.Назва_продукції, Продукція.Ціна_оптова, Продукція.Ціна_роздрібна, 
Рецепт.Вид_тіста, Рецепт.Начинка, Рецепт.[Трив_приготування(хв)] FROM Продукція, Рецепт
WHERE Продукція.Код_рецепту = Рецепт.Код_рецепту And Вид_тіста='Дріжджове'
