select * from [dbo].[Пекарня] where Код_пекарні = 4;

select [Прізвище], [Ім'я], [Номер_телефону] 
from [dbo].[Клієнти] LEFT JOIN Продажі ON
Клієнти.Код_клієнта = Продажі.Код_продажу;

select [Код_продукції],[Назва_продукції],[Тип_продукції] 
from [dbo].[Продукція] INNER JOIN [dbo].[Рецепт] on Продукція.Код_рецепту = Рецепт.Код_рецепту
where Тип_продукції='Хлібобулочні';

select [Продукція].[Назва_продукції], [Клієнти].[Прізвище],[Клієнти].[Ім'я] 
from [Продукція] inner join [Клієнти]
on [Продукція].[Код_продукції]=[Клієнти].[Код_клієнта]
WHERE [Назва_продукції] = 'Багет';

SELECT TOP 2 Продукція.Код_продукції, Продукція.Назва_продукції, Продажі.Код_клієнта, Продажі.Загальна_вартість
FROM Продукція INNER JOIN Продажі 
ON  Продукція.Код_продукції = Продажі.Код_продукції 
WHERE  Продукція.Код_продукції IN 
(SELECT  Продукція.Код_продукції FROM Продукція 
WHERE Тип_продукції = 'Хлібобулочні') 
ORDER BY Продажі.Загальна_вартість DESC;

SELECT Код_продукції, Назва_продукції, Тип_продукції FROM Продукція 
WHERE NOT EXISTS 
(SELECT * FROM Продажі WHERE Продажі.Код_продукції = Продукція.Код_продукції);

select Код_продукції, Назва_продукції, Тип_продукції, Ціна_оптова from Продукція 
Where Ціна_оптова<8;
