SELECT  [Прізвище], [Ім'я], [Код_клієнта] FROM [Клієнти] WHERE [Ім'я] LIKE '%В%'
ORDER BY [Прізвище]

SELECT [Код_продажу], [Код_пекарні], [Код_клієнта],[Загальна_вартість]
FROM [Продажі] ORDER BY [Код_продажу] DESC

SELECT  Продажі.Код_продажу, Продукція.Назва_продукції
FROM Продажі JOIN Продукція ON Продажі.Код_продажу = Продукція.Код_продукції

SELECT  COUNT(Продажі.Код_продажу) AS Код_клієнта, Продукція.Код_продукції
FROM Продажі JOIN Продукція ON Продажі.Код_продажу = Продукція.Код_продукції
GROUP BY Продукція.Код_продукції


