SELECT COUNT([Продукція].[Код_продукції]) AS Кількість_продукції FROM [Продукція]
WHERE [Начинка] = 1

SELECT MONTH([Продажі].[Дата_продажу]) AS Month, DAY([Продажі].[Дата_продажу]) AS Day, 
COUNT([Продажі].[Дата_продажу]) AS КількістьПроданих
FROM [Продажі] 
GROUP BY MONTH([Продажі].[Дата_продажу]), DAY([Продажі].[Дата_продажу])

SELECT Клієнти.Прізвище AS Клієнт, AVG(LEN([Ім'я])) AS Середнє
FROM Клієнти 
GROUP BY Клієнти.Прізвище;

SELECT TOP 1 [Клієнти].[Код_клієнта], COUNT([Продукція].[Код_продукції]) AS КількістьТоварів FROM [Клієнти]
JOIN [Продукція] ON [Клієнти].[Код_клієнта] = [Продукція].[Код_продукції]
GROUP BY [Клієнти].[Код_клієнта]
ORDER BY COUNT([Продукція].[Код_продукції]) Desc;
